In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('mock_data/weekly_financials.csv')

In [4]:
df2 = pd.read_csv('synthetic_data/synthetic_data.csv')

In [5]:
df.head()

,id,city,sex,date,salary,bonus,investment,rent,groceries,utilities,entertainment
0,ecbddaafbcdf,Los Angeles,F,2025-01-01,3468,1228,1475,2199,413,344,342
1,feebadaffaed,Chicago,F,2025-01-08,2788,1574,611,668,734,307,431
2,ceddaabafbfc,Los Angeles,M,2025-01-15,4519,327,62,1863,394,289,405
3,eebaaeabcddd,New York,M,2025-01-22,6288,1241,359,2268,418,354,69
4,bcaedafdaead,Los Angeles,F,2025-01-29,2277,606,631,1927,425,369,71

In [7]:
df2

,id,city,sex,date,salary,bonus,investment,rent,groceries,utilities,entertainment
0,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
1,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
2,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
3,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
4,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
...,...,...,...,...,...,...,...,...,...,...,...
95,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
96,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
97,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
98,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57
99,NaN,NaN,NaN,NaN,2162,0,5,502,102,65,57